xlyric/pv-router-esp32/src/main.cpp
//***********************************
//************* LIBRAIRIES ESP
//***********************************
#include <Arduino.h>
#include "driver/ledc.h"
#include "WiFiClientSecure.h"
#include <ESPmDNS.h>
#include <driver/adc.h>
#include <ElegantOTA.h>
#include <FS.h>
#include <Wire.h>  // Only needed for Arduino 1.6.5 and earlier
#include <ArduinoJson.h> // ArduinoJson : https://github.com/bblanchon/ArduinoJson
#include "uptime.h"
#include <driver/adc.h>
#include <OneWire.h>
#include <DallasTemperature.h>
#include <RBDdimmer.h>   /// the corrected librairy  in RBDDimmer-master-corrected.rar , the original has a bug

//***********************************
//************* PROGRAMME PVROUTEUR
//***********************************
#include "config/config.h"
#include "config/enums.h"
#include "config/traduction.h"
#include "langues/lang.h"
#include "functions/spiffsFunctions.h"
#include "tasks/Dimmer.h"
#include "tasks/Serial_task.h"
#include "tasks/dallas.h"
#include "tasks/gettemp.h"
#include "tasks/mDNS.h"
#include "tasks/measure-electricity.h"
#include "tasks/send-mqtt.h"
#include "tasks/switchDisplay.h"
#include "tasks/updateDisplay.h"
#include "tasks/watchdog_memory.h"
#include "tasks/wifi-connection.h"
#include "functions/ESP32.h"
#include "functions/Mqtt_http_Functions.h"
#include "functions/WifiFunctions.h"
#include "functions/dallasFunction.h"
#include "functions/dimmerFunction.h"
#include "functions/enphaseFunction.h"
#include "functions/froniusFunction.h"
#include "functions/homeassistant.h"
#include "functions/minuteur.h"
#include "functions/unified_dimmer.h"
#include "functions/webFunctions.h"

//***********************************
//************* S3 NON DECLARE
//************* A SUPPRIMER ?
//***********************************
#ifdef S3
  #include "pin_config.h"
#endif

//***********************************
//************* NTP valorisé dans 
//************* src/config/config.h
//***********************************
#if NTP
  #include <NTPClient.h>
  #include "tasks/fetch-time-from-ntp.h"
#endif

//***********************************
//************* WEBSOCKET_CLIENT
//************ Déprécié : a supprimer
//************ Usage futur : à conserver
//***********************************
#ifdef WEBSOCKET_CLIENT
  #include "functions/websocket.h"
#endif

//***********************************
//************* Afficheur Oled
//************* ESP32D1MINI_FIRMWARE
//************* option build
//************* plus nécessaire
//***********************************
#ifdef  ESP32D1MINI_FIRMWARE
 /// deja intégré dans display.h
#endif

//***********************************
//************* Afficheur TTGO
//************* TTGO
//************* option build
//***********************************
#ifdef  TTGO
  #include <TFT_eSPI.h>
  #include <SPI.h>
  TFT_eSPI display = TFT_eSPI();   
#endif

//***********************************
//************* VARIABLES GLOBALES
//***********************************
int pwmChannel = 0; //Choisit le canal 0
int frequence = 1000; //Fréquence PWM de 1 KHz
int resolution = 10; // Résolution de 8 bits, 256 valeurs possibles

//***********************************
//************* VARIABLES GLOBALES
//************* GESTION TACHES
//***********************************
TaskHandle_t myTaskmdnsdiscovery; 
TaskHandle_t myTaskwatchdogmemory;
TaskHandle_t myTaskkeepwifialive2;
TaskHandle_t myTaskserialreadtask;
TaskHandle_t myTaskupdatedisplay;
TaskHandle_t myTaskdallasread;
TaskHandle_t myTaskswitcholed;
TaskHandle_t myTaskmeasureelectricity;
TaskHandle_t myTaskupdatedimmer;
TaskHandle_t myTasksendtomqtt;
TaskHandle_t serialTaskHandle = NULL;
SemaphoreHandle_t mutex;  

//***********************************
//************* VARIABLES GLOBALES
//************* GESTION DISPLAY
//***********************************
DisplayValues gDisplayValues;

//***********************************
//************* VARIABLES GLOBALES
//************* CONFIGURATION
//***********************************
Config config; 
Configwifi configwifi; 
Configmodule configmodule; 

//***********************************
//************* VARIABLES GLOBALES
//************* PROGRAMMATEURS
//***********************************
Programme programme; 
Programme programme_relay1;
Programme programme_relay2;
Programme programme_marche_forcee;

//***********************************
//************* VARIABLES GLOBALES
//************* LOGS
//***********************************
Logs logging;

//***********************************
//************* VARIABLES GLOBALES
//************* MQTT
//***********************************
Mqtt configmqtt;

//***********************************
//************* VARIABLES GLOBALES
//************* SURVEILLANCE MEMOIRE
//***********************************
Memory task_mem; 

//***********************************
//************* VARIABLES GLOBALES
//************* SONDE DALLAS
//***********************************
Dallas dallas; 

//***********************************
//************* VARIABLES GLOBALES
//************* MQTT HA
//***********************************
unsigned short measurements[LOCAL_MEASUREMENTS]; // NOSONAR
#ifndef LIGHT_FIRMWARE
    HA device_dimmer; 
    HA device_routeur; 
    HA device_routed; // Ajout envoi MQTT puissance routée totale (local + distants)
    HA device_dimmer_power; // Ajout MQTT envoi puissance du dimmer local
    HA device_grid;
    HA device_inject;
    HA compteur_inject;
    HA compteur_grid;
    HA switch_1;
    HA temperature_HA;
    HA power_factor;
    HA power_apparent;
    HA switch_relay1;
    HA switch_relay2;
    HA device_dimmer_boost;
#endif

//***********************************
//************* VARIABLES GLOBALES
//************* DEPRECIEES A SUPPR
//*************   measureIndex dans drawFunction.h
//***********************************
unsigned char measureIndex = 0;

//***********************************
//************* VARIABLES FONCTIONS
//***********************************
void connect_to_wifi();
void handler_before_reset();
void reboot_after_lost_wifi(int timeafterlost);
void IRAM_ATTR function_off_screen();
void IRAM_ATTR function_next_screen();
bool boost();
void myTask(void *pvParameters);

//***********************************
//************* VARIABLES GLOBALES
//************* DIMMERS
//***********************************
gestion_puissance unified_dimmer;
dimmerLamp dimmer1(outputPin, zerocross); //initialase port for dimmer for ESP8266, ESP32, Arduino due boards
#ifdef outputPin2
  dimmerLamp dimmer2(outputPin2, zerocross); //initialase port for dimmer for ESP8266, ESP32, Arduino due boards
  dimmerLamp dimmer3(outputPin3, zerocross); //initialase port for dimmer for ESP8266, ESP32, Arduino due boards
#endif

//***********************************
//************* SETUP
//***********************************
void setup()
{
  #if DEBUG == true
    Serial.begin(115200);
  #endif 

  // Redirection des messages de DEBUG ves le port série
  // CORE_DEBUG_LEVEL est définie dans les options de BUILD
  #if CORE_DEBUG_LEVEL > ARDUHAL_LOG_LEVEL_NONE
    Serial.setDebugOutput(true);
  #endif

  // Initialisation de la LOG
  Serial.println("\n================== " + String(VERSION) + " ==================");
  logging.Set_log_init("197}11}1");
  logging.Set_log_init("#################  "+ String(Reason_for_reset) +"  ###############\r\n");
  esp_reset_reason_t reason = esp_reset_reason();
  logging.Set_log_init(String(reason).c_str());
  logging.Set_log_init("\r\n#################  "+ String(Starting_System)+ "  ###############\r\n");
  
