xlyric/pv-router-esp32/src/main.cpp
  #if WIFI_ACTIVE == true
    #if WEBSSERVER == true
      //***********************************
      //************* Setup -  demarrage du webserver et affichage de l'oled
      //***********************************
      Serial.println("start Web server");
      call_pages();
    #endif // WEBSERVER

    //***********************************
    //************* Setup -  init xTask
    //***********************************
    // ----------------------------------------------------------------
    // TASK: Connect to WiFi & keep the connection alive (dépréciée -> keepWifiAlive2)
    // ----------------------------------------------------------------
    /*
    if (!AP) { // NOSONAR
      xTaskCreate( // NOSONAR
        keepWiFiAlive, // NOSONAR
        "keepWiFiAlive",  // Task name // NOSONAR
        8000,            // Stack size (bytes) // NOSONAR
        NULL,             // Parameter // NOSONAR
        5,                // Task priority // NOSONAR
        NULL          // Task handle // NOSONAR      
      );  //pdMS_TO_TICKS(30000)// NOSONAR
    } //AP // NOSONAR
    */
    // ----------------------------------------------------------------
    // TASK: watchdog Mémory
    // ----------------------------------------------------------------
    /*
    xTaskCreatePinnedToCore(
      watchdog_memory,
      "watchdog_memory",  // Task name
      4000,            // Stack size (bytes)
      NULL,             // Parameter
      3,                // Task priority
      &myTaskwatchdogmemory,          // Task handle
      0
    );  
    */
    // ----------------------------------------------------------------
    // TASK: recherche de dimmer
    // ----------------------------------------------------------------
    xTaskCreatePinnedToCore (
        mdns_discovery,
        "mdns_discovery",  // Task name
        3000,            // Stack size (bytes)
        NULL,             // Parameter
        1,                // Task priority
        &myTaskmdnsdiscovery,          // Task handle
        ARDUINO_RUNNING_CORE
    );  // le service est arreté si un dimmer est trouvé ou déjà configuré --> necessite reboot pour rechercher de nouveau
    // ----------------------------------------------------------------
    // TASK: remettre le wifi en route en cas de passage en mode AP
    // ----------------------------------------------------------------
    xTaskCreate(
      keepWiFiAlive2,
      "keepWiFiAlive",  // Task name
      3000,            // Stack size (bytes)
      NULL,             // Parameter
      2,                // Task priority
      &myTaskkeepwifialive2          // Task handle      
    );  
  #endif // WIFI_ACTIVE
  // ----------------------------------------------------------------
  // TASK: envoie d'information série
  // ----------------------------------------------------------------
  //// la task a un timeout et le mode série ne répond plus après 2 minutes ce qui laisse le temps de faire les reglages wifi sur l'OTA
  xTaskCreate(
    serial_read_task,
    "Serial Read",      // Task name
    3000,            // Stack size (bytes)
    NULL,             // Parameter
    2,                // Task priority
    &myTaskserialreadtask              // Task handle
  );  /// le service est arreté après 2 minutes
  // ----------------------------------------------------------------
  // TASK: Update the display every second
  // ----------------------------------------------------------------
  //       This is pinned to the same core as Arduino
  //       because it would otherwise corrupt the OLED
  // ----------------------------------------------------------------
  #if OLED_ON == true
    #ifdef ESP32D1MINI_FIRMWARE
      Serial.println("init oled 0.7'' ");
      init_ui();
    #endif // ESP32D1MINI_FIRMWARE
    xTaskCreate(
      updateDisplay,
      "UpdateDisplay",  // Task name
      3500,            // Stack size (bytes)
      NULL,             // Parameter
      2,                // Task priority
      &myTaskupdatedisplay             // Task handle      
    );  
  #endif // OLED_ON

  // ----------------------------------------------------------------
  // Task: Read Dallas Temp
  // ----------------------------------------------------------------
  if (dallas.detect) {
    xTaskCreate(
      dallasread,
      "Dallas local temp",  // Task name
      4000,                  // Stack size (bytes)
      NULL,                   // Parameter
      2,                      // Task priority
      &myTaskdallasread       // Task handle
    ); 
  }

  // ----------------------------------------------------------------
  // Task: Update Dimmer power
  // ----------------------------------------------------------------
  #ifdef TTGO
    #ifndef ESP32D1MINI_FIRMWARE
      attachInterrupt(SWITCH, function_off_screen, FALLING);
      attachInterrupt(BUTTON_LEFT, function_next_screen, FALLING);
      xTaskCreate( 
        switchDisplay,
        "Swith Oled",  // Task name
        3000,                  // Stack size (bytes)
        NULL,                   // Parameter
        2,                      // Task priority
        &myTaskswitcholed                    // Task handle
      ); 
    #endif // ESP32D1MINI_FIRMWARE
  #endif // TTGO

  // ----------------------------------------------------------------
  // Task: measure electricity consumption ;)
  // ----------------------------------------------------------------
  xTaskCreate(
    measureElectricity,
    "Measure electricity",  // Task name
    5000,                  // Stack size (bytes)
    NULL,                   // Parameter
    4,                      // Task priority
    &myTaskmeasureelectricity                    // Task handle
  );  

  // ----------------------------------------------------------------
  // Task: Update Dimmer power
  // ----------------------------------------------------------------
  #if WIFI_ACTIVE == true
    #if DIMMER == true
      xTaskCreatePinnedToCore(
        updateDimmer,
        "Update Dimmer",  // Task name
        4000,                  // Stack size (bytes)
        NULL,                   // Parameter
        4,                      // Task priority
        &myTaskupdatedimmer,                    // Task handle
        ARDUINO_RUNNING_CORE
      );  
      // ----------------------------------------------------------------
      // Task: Get Dimmer temp
      // ----------------------------------------------------------------
      if (!dallas.detect) {
        xTaskCreatePinnedToCore(
          GetDImmerTemp,
          "Update temp",  // Task name
          4000,                  // Stack size (bytes)
          NULL,                   // Parameter
          2,                      // Task priority
          NULL,                    // Task handle
          ARDUINO_RUNNING_CORE
        );  
      }
      // ----------------------------------------------------------------
      // Task: MQTT send
      // ----------------------------------------------------------------
      xTaskCreatePinnedToCore(
        send_to_mqtt,
        "Update MQTT",  // Task name
        4500,                  // Stack size (bytes)
        NULL,                   // Parameter
        2,                      // Task priority
        &myTasksendtomqtt,                    // Task handle
        ARDUINO_RUNNING_CORE
      );  
    #endif // DIMMER = true
  #endif // WIFI_ACTIVE=true

  //***********************************
  //************* Setup - init ElegantOTA
  //***********************************   
  #if WIFI_ACTIVE == true
    #if WEBSSERVER == true
      ElegantOTA.begin(&server);
      server.begin(); 
    #endif

    //***********************************
    //************* Setup - MQTT init
    //***********************************   
    #ifndef LIGHT_FIRMWARE
      if (!AP) {
          if (config.mqtt) {
            Mqtt_init();            
            if (!client.connected() && (WiFi.status() == WL_CONNECTED )) { 
              reconnect(); 
              delay (1000);
            }
            // HA autoconf
            if (configmqtt.HA) 
              init_HA_sensor();            
          }
      }
    #endif // not LIGHT_FIRMWARE

